Repository: yaolin-dev/OKVideoMac
Catalog: OKVideoMac/macOS/OKVideoMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# android.install.error.cancelled.message
source: You can continue the next time Android content needs this component.
zh_hans: 下次使用需要 Android 的内容时可以继续。

# android.install.error.cancelled.title
source: Installation Cancelled
zh_hans: 已取消安装

# android.install.error.catalog.message
source: The installation catalog failed security validation. No runtime files were downloaded or changed.
zh_hans: 安装清单未通过安全校验，应用没有下载或修改任何运行环境。

# android.install.error.catalog.title
source: Android Compatibility Component Is Temporarily Unavailable
zh_hans: Android 兼容组件暂不可用

# android.install.error.compatibility.message
source: This Mac does not meet the system requirements for the current Android compatibility component.
zh_hans: 这台 Mac 不满足当前 Android 兼容组件的系统要求。

# android.install.error.compatibility.title
source: Android Compatibility Component Is Unsupported
zh_hans: Android 兼容组件不受支持

# android.install.error.disk-space.message
source: Free up disk space, then continue the installation.
zh_hans: 释放磁盘空间后可以继续安装。

# android.install.error.disk-space.title
source: Not Enough Disk Space
zh_hans: 可用磁盘空间不足

# android.install.error.download.title
source: Android Compatibility Component Download Failed
zh_hans: Android 兼容组件下载失败

# android.install.error.integrity.message
source: The downloaded file failed its integrity check and was not installed. Try again.
zh_hans: 下载文件未通过完整性校验，未安装该文件。请重试。

# android.install.error.integrity.title
source: Android Compatibility Component Verification Failed
zh_hans: Android 兼容组件校验失败

# android.install.error.internal.message
source: The installation was not activated. The previous runtime remains unchanged. Try again or export diagnostics.
zh_hans: 安装未生效，原有运行环境保持不变。请重试或导出诊断。

# android.install.error.internal.title
source: Android Compatibility Component Installation Failed
zh_hans: Android 兼容组件安装失败

# android.install.error.invalid-installation.message
source: The new environment was not activated. The previous runtime remains unchanged. Try again or export diagnostics.
zh_hans: 新环境未生效，原有运行环境保持不变。请重试或导出诊断。

# android.install.error.invalid-installation.title
source: Android Compatibility Component Installation Failed
zh_hans: Android 兼容组件安装失败

# android.install.error.network.message
source: The download did not finish. Any resumable data was preserved. Check your network and try again.
zh_hans: 下载未完成，已保留可继传的部分文件。请检查网络后重试。

# android.install.extracting
source: Extracting Components
zh_hans: 正在解压组件

# android.install.facts.disk-space
source: Required Disk Space
zh_hans: 安装所需空间

# android.install.facts.download
source: Download Size
zh_hans: 预计下载

# android.install.facts.location
source: Install Location
zh_hans: 安装位置

# android.install.facts.private-directory
source: OKVideoMac Private Directory
zh_hans: OKVideoMac 专用目录

# android.install.installing
source: Installing the Runtime
zh_hans: 正在安装运行环境

# android.install.license.acceptance
source: I have read and agree to the required component licenses
zh_hans: 我已阅读并同意所需组件的许可条款

# android.install.needs-component
source: This Content Requires the Android Compatibility Component
zh_hans: 当前内容需要 Android 兼容组件

# android.install.preparing
source: Preparing Installation
zh_hans: 正在准备安装

# android.install.repairing
source: Repairing the Compatibility Component
zh_hans: 正在修复兼容组件

# android.install.title.action-required
source: Android Compatibility Component Needs Attention
zh_hans: Android 兼容组件需要处理

# android.install.title.install
source: Install Android Compatibility Component
zh_hans: 安装 Android 兼容组件

# android.install.title.ready
source: Android Compatibility Component Is Ready
zh_hans: Android 兼容组件已就绪

# android.install.title.update-available
source: Android Compatibility Component Update Available
zh_hans: Android 兼容组件可更新

# android.install.update-available
source: An Android Compatibility Component Update Is Available
zh_hans: Android 兼容组件有可用更新

# android.install.use-configured-sdk
source: Use Configured Android SDK
zh_hans: 使用已配置的 Android SDK

# android.install.validating
source: Validating the Runtime
zh_hans: 正在验证运行环境

# android.install.verifying
source: Verifying Downloads
zh_hans: 正在校验下载内容

# cloud.status.authenticated
source: Signed In
zh_hans: 已登录

# cloud.status.pending
source: Previously Authorized
zh_hans: 上次已授权

# cloud.status.unauthenticated
source: Not Signed In
zh_hans: 未登录

# common.cancel
source: Cancel
zh_hans: 取消

# common.close
source: Close
zh_hans: 关闭

# common.ok
source: OK
zh_hans: 好

# common.restart
source: Restart Now
zh_hans: 现在重启

# diagnostics.export.action
source: Export Diagnostics…
zh_hans: 导出诊断…

# diagnostics.export.failed.title
source: Diagnostics Export Failed
zh_hans: 诊断导出失败

# language.follow-system
source: Follow System
zh_hans: 跟随系统

# language.zh-hans
source: Simplified Chinese
zh_hans: 简体中文

# settings.advanced.app-info.section
source: App Information
zh_hans: 应用信息

# settings.advanced.configuration.none
source: No video provider configuration has been imported
zh_hans: 尚未导入点播配置

# settings.advanced.security.compatibility
source: The minimum supported system is macOS 12.0. DRM, TVBus, and ForceTech are not executed.
zh_hans: 最低系统为 macOS 12.0；DRM、TVBus 和 ForceTech 当前不执行。

# settings.advanced.security.no-content
source: The app does not include media providers, accounts, cookies, resolver URLs, or DRM keys.
zh_hans: 应用不内置影视源、账号、Cookie、解析地址或 DRM 密钥。

# settings.advanced.security.section
source: Security & Scope
zh_hans: 安全与范围

# settings.android.action.rebuild-runtime
source: Repair Android Runtime…
zh_hans: 修复 Android Runtime…

# settings.android.action.repair-bridge
source: Repair Bridge
zh_hans: 修复 Bridge

# settings.android.action.switch-to
source: Switch To…
zh_hans: 改用…

# settings.android.current-runtime.title
source: Current Runtime
zh_hans: 当前运行环境

# settings.android.isolation.external
source: ADB and Emulator always come from the selected SDK, while OKVideoMac continues to use its private ADB server, keys, and dedicated AVD.
zh_hans: ADB 与 Emulator 固定来自所选 SDK；仍使用 OKVideoMac 私有 ADB、密钥和专用 AVD。

# settings.android.isolation.managed
source: Required files are downloaded on demand to an OKVideoMac private directory. External Android tools are never read or reused.
zh_hans: 所需文件按需下载到 OKVideoMac 专用目录；不会读取或借用外部 Android 工具。

# settings.android.managed.incompatible
source: Android compatibility component is incompatible
zh_hans: Android 兼容组件不兼容

# settings.android.managed.installed
source: Android compatibility component installed
zh_hans: Android 兼容组件已安装

# settings.android.managed.needs-repair
source: Android compatibility component needs repair
zh_hans: Android 兼容组件需要修复

# settings.android.managed.not-installed
source: Android compatibility component not installed
zh_hans: Android 兼容组件未安装

# settings.android.managed.ready-detail
source: Managed independently by OKVideoMac and started only when Dex content needs it
zh_hans: 受 OKVideoMac 独立管理，仅在 Dex 内容需要时启动

# settings.android.managed.update-available
source: Android compatibility component update available
zh_hans: Android 兼容组件可更新

# settings.android.managed.update-detail
source: A new runtime can be installed. The current runtime remains active until the new version is validated.
zh_hans: 可安装新环境；当前环境会保留到新版本验证完成

# settings.android.mode.external.detail
source: Android content uses only the SDK selected below and never triggers Managed Runtime installation
zh_hans: Android 内容只使用下方明确选择的 SDK；不会触发托管安装

# settings.android.mode.managed.detail
source: Android content uses only verified components managed by OKVideoMac
zh_hans: Android 内容只使用经过校验的 OKVideoMac 托管组件

# settings.android.mode.managed.title
source: Managed by OKVideoMac (Recommended)
zh_hans: OKVideoMac 自动管理（推荐）

# settings.android.section.title
source: Android Compatibility
zh_hans: Android 兼容模块

# settings.backup.available.section
source: Data Available for Backup
zh_hans: 当前可备份数据

# settings.backup.configuration.available-detail
source: Includes the last successfully loaded configuration snapshot
zh_hans: 包含最后一次成功加载的配置快照

# settings.backup.configuration.none
source: No video provider configuration is active
zh_hans: 尚未启用点播配置

# settings.backup.configuration.title
source: Current Video Provider Configuration
zh_hans: 当前点播配置

# settings.backup.export.failed
source: Backup Export Failed
zh_hans: 备份导出失败

# settings.backup.export.title
source: Export Current Configuration, History and Favorites
zh_hans: 导出当前配置、历史与收藏

# settings.backup.history.detail
source: Includes source, episode, playback position, and watch time
zh_hans: 保留线路、分集、播放位置和观看时间

# settings.backup.history.title
source: Related Watch History
zh_hans: 对应观看历史

# settings.backup.manual.section
source: Manual Backup
zh_hans: 手动备份

# settings.backup.preview.exported-at
source: Exported
zh_hans: 导出时间

# settings.backup.preview.verified
source: The file passed format and integrity validation
zh_hans: 文件已经通过格式和完整性校验

# settings.backup.preview.version
source: Export Version
zh_hans: 导出版本

# settings.backup.read.failed
source: Unable to Read Backup
zh_hans: 无法读取备份

# settings.backup.restore.confirm
source: Import and Merge
zh_hans: 导入并合并

# settings.backup.restore.failed
source: Backup Restore Failed
zh_hans: 备份恢复失败

# settings.backup.restore.merge-note
source: When the same history item exists twice, the record with the newer watch time is kept. Current providers and history are backed up before import. Cloud account authorization is never overwritten.
zh_hans: 同一条历史会保留观看时间更新的记录；导入前会自动备份当前配置和历史。网盘账号授权不会被覆盖。

# settings.backup.restore.safety-suffix
source: Your previous data was saved as a safety backup.
zh_hans: 导入前的数据已保存为安全备份。

# settings.backup.restore.subtitle
source: Preview the contents and automatically save current data before import
zh_hans: 导入前会预览内容并自动保存当前数据

# settings.backup.restore.title
source: Restore from Backup
zh_hans: 从备份恢复

# settings.backup.security.message
source: Backups do not export Keychain items, cloud account status, QR codes, temporary playback URLs, or Android virtual machine data. Original configuration text is included and may contain private provider URLs. The file is not encrypted, so store it securely. If cloud authorization is no longer valid after a restore, the player will request it again.
zh_hans: 备份不会额外导出钥匙串、网盘账号状态、二维码、临时播放地址或 Android 虚拟机数据。配置原文会随备份保存，可能包含私人源地址；文件未加密，请妥善保管。恢复后如网盘授权不可用，播放器会重新请求授权。

# settings.backup.security.section
source: Security Notes
zh_hans: 安全说明

# settings.backup.subtitle
source: Export the current configuration, watch history, and favorites
zh_hans: 导出当前点播配置、观看历史与收藏

# settings.cache.images.section
source: Image Cache
zh_hans: 图像缓存

# settings.cache.poster.subtitle
source: Space used by current posters and channel logos
zh_hans: 当前海报与频道 Logo 占用空间

# settings.common.cancel
source: Cancel
zh_hans: 取消

# settings.common.change
source: Change…
zh_hans: 更改…

# settings.common.current-configuration
source: Current Configuration
zh_hans: 当前配置

# settings.common.delete
source: Delete
zh_hans: 删除

# settings.common.disabled
source: Off
zh_hans: 已关闭

# settings.common.enabled
source: On
zh_hans: 已开启

# settings.common.export
source: Export…
zh_hans: 导出…

# settings.common.install
source: Install…
zh_hans: 安装…

# settings.common.repair
source: Repair…
zh_hans: 修复…

# settings.common.restore-default
source: Restore Default
zh_hans: 恢复默认

# settings.common.save
source: Save
zh_hans: 保存

# settings.common.start
source: Start
zh_hans: 启动

# settings.common.stop
source: Stop
zh_hans: 停止

# settings.common.update
source: Update…
zh_hans: 更新…

# settings.common.use
source: Use
zh_hans: 使用

# settings.diagnostics.subtitle
source: Export redacted runtime status and provider capabilities
zh_hans: 导出经过脱敏的运行状态与站点能力

# settings.diagnostics.title
source: Export Diagnostics
zh_hans: 导出诊断信息

# settings.general.appearance.section
source: Appearance
zh_hans: 外观

# settings.general.history-retention.title
source: History Retention
zh_hans: 历史保留

# settings.general.incognito.subtitle
source: Do not save new watch history while enabled
zh_hans: 开启后不写入新的观看历史

# settings.general.incognito.title
source: Private Mode
zh_hans: 无痕模式

# settings.general.subtitle
source: Appearance, privacy, and history
zh_hans: 外观、隐私和历史记录

# settings.history.retention.one-year
source: 1 year
zh_hans: 1 年

# settings.history.retention.ten-years
source: 10 years
zh_hans: 10 年

# settings.language.restart.failure.message
source: OKVideoMac couldn't restart automatically. Quit and reopen the app to apply the new language.
zh_hans: OKVideoMac 无法自动重新启动。请退出并重新打开 App 以应用新的语言。

# settings.language.restart.failure.title
source: Unable to Restart
zh_hans: 无法重新启动

# settings.language.restart.later
source: Later
zh_hans: 稍后

# settings.language.restart.message
source: Restart OKVideoMac to apply the new display language.
zh_hans: 重启 OKVideoMac 后将使用新的显示语言。

# settings.language.restart.title
source: Restart Required
zh_hans: 需要重启

# settings.language.subtitle
source: Choose the language used by OKVideoMac
zh_hans: 选择 OKVideoMac 使用的界面语言

# settings.language.title
source: Language
zh_hans: 语言

# settings.live.delete.help
source: Delete Live TV Source
zh_hans: 删除直播源

# settings.live.delete.message
source: Only this live TV source will be removed. Video providers, favorites, and history are unaffected.
zh_hans: 只删除这条直播源，不会影响点播配置、收藏或历史。

# settings.live.empty.subtitle
source: Supports remote URLs, local M3U/M3U8/TXT/JSON files, and pasted content.
zh_hans: 支持远程 URL、本地 M3U/M3U8/TXT/JSON 文件和粘贴内容。

# settings.live.empty.title
source: No Live TV Sources
zh_hans: 尚未添加直播源

# settings.live.file-selection.failed
source: Unable to Select Live TV File
zh_hans: 无法选择直播文件

# settings.live.import-file.subtitle
source: Supports M3U, M3U8, TXT, and JSON
zh_hans: 支持 M3U、M3U8、TXT 和 JSON

# settings.live.import-file.title
source: Import Local Live TV File
zh_hans: 导入本地直播文件

# settings.live.refresh.help
source: Refresh Live TV Source
zh_hans: 刷新直播源

# settings.live.subtitle
source: Import, refresh, and maintain live TV channel lists
zh_hans: 导入、刷新和维护直播频道列表

# settings.pane.backup.title
source: Backup & Restore
zh_hans: 备份与恢复

# settings.pane.general.subtitle
source: Appearance and basic settings
zh_hans: 外观与基础设置

# settings.pane.live.subtitle
source: Import and manage live TV sources
zh_hans: 导入与管理直播源

# settings.pane.playback.subtitle
source: Player and playback settings
zh_hans: 播放器与播放设置

# settings.pane.providers.subtitle
source: Add and switch video providers
zh_hans: 添加与切换点播片源

# settings.pane.search.title
source: Search
zh_hans: 搜索

# settings.playback.autoplay.subtitle
source: Play the next episode after the current episode ends naturally
zh_hans: 当前一集自然播放结束后继续播放下一集

# settings.playback.backend.detail
source: Built-in libmpv playback backend
zh_hans: 内嵌 libmpv 播放后端

# settings.playback.hardware-decoding.subtitle
source: Prefer system hardware decoding during playback
zh_hans: 播放时优先使用系统硬件解码能力

# settings.playback.section
source: Player
zh_hans: 播放器

# settings.playback.status.title
source: Current Status
zh_hans: 当前状态

# settings.playback.subtitle
source: Player status and playback options
zh_hans: 播放器状态和播放选项

# settings.player-window.mode.label
source: Player Window Mode
zh_hans: 播放器窗口模式

# settings.player-window.title
source: Player Window
zh_hans: 播放器窗口

# settings.providers.subtitle
source: Add a provider and choose one to watch
zh_hans: 添加你的片源，选择一个开始观看

# settings.search.configuration.saved-separately
source: Search scope is saved separately for each configuration
zh_hans: 搜索范围按配置分别保存，互不影响

# settings.search.note.result-filter
source: The Result Providers control only filters existing results and does not make new network requests.
zh_hans: 搜索结果页的“结果来源”只过滤已有结果，不产生新的网络请求。

# settings.search.note.scope
source: The search scope determines which providers receive requests.
zh_hans: 搜索范围决定会向哪些站点发起请求。

# settings.search.pending-change
source: Changes take effect with the next search. The current search scope remains unchanged.
zh_hans: 保存后从下一次搜索生效，当前搜索范围保持不变。

# settings.search.restore-all
source: Restore All Providers
zh_hans: 恢复全部站点

# settings.window.main.restore.help
source: Restore the main window to its default size for the current display and center it
zh_hans: 将主窗口恢复到适合当前屏幕的默认大小并居中

# settings.window.main.title
source: Main Window
zh_hans: 主窗口

# sidebar.browse
source: Browse
zh_hans: 点播

# sidebar.favorites
source: Favorites
zh_hans: 收藏

# sidebar.history
source: History
zh_hans: 历史

# sidebar.live-tv
source: Live TV
zh_hans: 直播

# sidebar.settings
source: Settings
zh_hans: 设置

# theme.dark
source: Dark
zh_hans: 深色

# theme.light
source: Light
zh_hans: 浅色

# theme.system
source: System
zh_hans: 跟随系统

# episode.version
source: Version %d
zh_hans: 版本 %d
zh_hant: 版本 %d

# player.versions
source: Versions
zh_hans: 版本
zh_hant: 版本

# player.version-count
source: %d versions
zh_hans: 共 %d 个版本
zh_hant: 共 %d 個版本

# live.loading-slow
source: Connection is taking longer than usual
zh_hans: 连接较慢，请稍候
zh_hant: 連線較慢，請稍候

# live.loading-channel
source: Loading %@…
zh_hans: 正在加载 %@…
zh_hant: 正在載入 %@…

# live.next-channel
source: Next Channel
zh_hans: 下一个频道
zh_hant: 下一個頻道

# live.channel-unavailable
source: This channel could not be loaded. Try again or choose another channel.
zh_hans: 当前频道暂时无法播放，请重试或切换频道。
zh_hant: 目前頻道暫時無法播放，請重試或切換頻道。

# detail.synopsis-title
source: Synopsis
zh_hans: 简介
zh_hant: 簡介
